MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32PG26B101F512IM68/mcu.h
/**************************************************************************//**
 * @file
 * @brief CMSIS Cortex-M Peripheral Access Layer Header File
 *        for EFM32PG26B101F512IM68
 ******************************************************************************
 * # License
 * <b>Copyright 2025 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFM32PG26B101F512IM68_H
#define EFM32PG26B101F512IM68_H

#ifdef __cplusplus
extern "C" {
#endif

/**************************************************************************//**
 * @addtogroup Parts
 * @{
 *****************************************************************************/

/**************************************************************************//**
 * @defgroup EFM32PG26B101F512IM68 EFM32PG26B101F512IM68
 * @{
 *****************************************************************************/

/** Interrupt Number Definition */
typedef enum IRQn{
  /******  Cortex-M Processor Exceptions Numbers ******************************************/
  NonMaskableInt_IRQn    = -14,             /*!< -14 Cortex-M Non Maskable Interrupt      */
  HardFault_IRQn         = -13,             /*!< -13 Cortex-M Hard Fault Interrupt        */
  MemoryManagement_IRQn  = -12,             /*!< -12 Cortex-M Memory Management Interrupt */
  BusFault_IRQn          = -11,             /*!< -11 Cortex-M Bus Fault Interrupt         */
  UsageFault_IRQn        = -10,             /*!< -10 Cortex-M Usage Fault Interrupt       */
  SecureFault_IRQn       = -9,              /*!< -9  Cortex-M Secure Fault Interrupt      */
  SVCall_IRQn            = -5,              /*!< -5  Cortex-M SV Call Interrupt           */
  DebugMonitor_IRQn      = -4,              /*!< -4  Cortex-M Debug Monitor Interrupt     */
  PendSV_IRQn            = -2,              /*!< -2  Cortex-M Pend SV Interrupt           */
  SysTick_IRQn           = -1,              /*!< -1  Cortex-M System Tick Interrupt       */

  /******  EFM32PG26 Peripheral Interrupt Numbers ******************************************/

  SMU_SECURE_IRQn        = 0,  /*!<  0 EFM32 SMU_SECURE Interrupt */
  SMU_S_PRIVILEGED_IRQn  = 1,  /*!<  1 EFM32 SMU_S_PRIVILEGED Interrupt */
  SMU_NS_PRIVILEGED_IRQn = 2,  /*!<  2 EFM32 SMU_NS_PRIVILEGED Interrupt */
  EMU_IRQn               = 3,  /*!<  3 EFM32 EMU Interrupt */
  TIMER0_IRQn            = 4,  /*!<  4 EFM32 TIMER0 Interrupt */
  TIMER1_IRQn            = 5,  /*!<  5 EFM32 TIMER1 Interrupt */
  TIMER2_IRQn            = 6,  /*!<  6 EFM32 TIMER2 Interrupt */
  TIMER3_IRQn            = 7,  /*!<  7 EFM32 TIMER3 Interrupt */
  TIMER4_IRQn            = 8,  /*!<  8 EFM32 TIMER4 Interrupt */
  TIMER5_IRQn            = 9,  /*!<  9 EFM32 TIMER5 Interrupt */
  TIMER6_IRQn            = 10, /*!< 10 EFM32 TIMER6 Interrupt */
  TIMER7_IRQn            = 11, /*!< 11 EFM32 TIMER7 Interrupt */
  TIMER8_IRQn            = 12, /*!< 12 EFM32 TIMER8 Interrupt */
  TIMER9_IRQn            = 13, /*!< 13 EFM32 TIMER9 Interrupt */
  USART0_RX_IRQn         = 14, /*!< 14 EFM32 USART0_RX Interrupt */
  USART0_TX_IRQn         = 15, /*!< 15 EFM32 USART0_TX Interrupt */
  USART1_RX_IRQn         = 16, /*!< 16 EFM32 USART1_RX Interrupt */
  USART1_TX_IRQn         = 17, /*!< 17 EFM32 USART1_TX Interrupt */
  USART2_RX_IRQn         = 18, /*!< 18 EFM32 USART2_RX Interrupt */
  USART2_TX_IRQn         = 19, /*!< 19 EFM32 USART2_TX Interrupt */
  EUSART0_RX_IRQn        = 20, /*!< 20 EFM32 EUSART0_RX Interrupt */
  EUSART0_TX_IRQn        = 21, /*!< 21 EFM32 EUSART0_TX Interrupt */
  EUSART1_RX_IRQn        = 22, /*!< 22 EFM32 EUSART1_RX Interrupt */
  EUSART1_TX_IRQn        = 23, /*!< 23 EFM32 EUSART1_TX Interrupt */
  EUSART2_RX_IRQn        = 24, /*!< 24 EFM32 EUSART2_RX Interrupt */
  EUSART2_TX_IRQn        = 25, /*!< 25 EFM32 EUSART2_TX Interrupt */
  EUSART3_RX_IRQn        = 26, /*!< 26 EFM32 EUSART3_RX Interrupt */
  EUSART3_TX_IRQn        = 27, /*!< 27 EFM32 EUSART3_TX Interrupt */
  ICACHE0_IRQn           = 29, /*!< 29 EFM32 ICACHE0 Interrupt */
  BURTC_IRQn             = 30, /*!< 30 EFM32 BURTC Interrupt */
  LETIMER0_IRQn          = 31, /*!< 31 EFM32 LETIMER0 Interrupt */
  SYSCFG_IRQn            = 32, /*!< 32 EFM32 SYSCFG Interrupt */
  MPAHBRAM0_IRQn         = 33, /*!< 33 EFM32 MPAHBRAM0 Interrupt */
  MPAHBRAM1_IRQn         = 34, /*!< 34 EFM32 MPAHBRAM1 Interrupt */
  LDMA_IRQn              = 35, /*!< 35 EFM32 LDMA Interrupt */
  LFXO_IRQn              = 36, /*!< 36 EFM32 LFXO Interrupt */
  LFRCO_IRQn             = 37, /*!< 37 EFM32 LFRCO Interrupt */
  ULFRCO_IRQn            = 38, /*!< 38 EFM32 ULFRCO Interrupt */
  GPIO_ODD_IRQn          = 39, /*!< 39 EFM32 GPIO_ODD Interrupt */
  GPIO_EVEN_IRQn         = 40, /*!< 40 EFM32 GPIO_EVEN Interrupt */
  I2C0_IRQn              = 41, /*!< 41 EFM32 I2C0 Interrupt */
  I2C1_IRQn              = 42, /*!< 42 EFM32 I2C1 Interrupt */
  I2C2_IRQn              = 43, /*!< 43 EFM32 I2C2 Interrupt */
  I2C3_IRQn              = 44, /*!< 44 EFM32 I2C3 Interrupt */
  EMUDG_IRQn             = 45, /*!< 45 EFM32 EMUDG Interrupt */
  HOSTMAILBOX_IRQn       = 54, /*!< 54 EFM32 HOSTMAILBOX Interrupt */
  ACMP0_IRQn             = 56, /*!< 56 EFM32 ACMP0 Interrupt */
  ACMP1_IRQn             = 57, /*!< 57 EFM32 ACMP1 Interrupt */
  WDOG0_IRQn             = 58, /*!< 58 EFM32 WDOG0 Interrupt */
  WDOG1_IRQn             = 59, /*!< 59 EFM32 WDOG1 Interrupt */
  HFXO0_IRQn             = 60, /*!< 60 EFM32 HFXO0 Interrupt */
  HFRCO0_IRQn            = 61, /*!< 61 EFM32 HFRCO0 Interrupt */
  HFRCOEM23_IRQn         = 62, /*!< 62 EFM32 HFRCOEM23 Interrupt */
  CMU_IRQn               = 63, /*!< 63 EFM32 CMU Interrupt */
  IADC_IRQn              = 65, /*!< 65 EFM32 IADC Interrupt */
  MSC_IRQn               = 66, /*!< 66 EFM32 MSC Interrupt */
  DPLL0_IRQn             = 67, /*!< 67 EFM32 DPLL0 Interrupt */
  EMUEFP_IRQn            = 68, /*!< 68 EFM32 EMUEFP Interrupt */
  DCDC_IRQn              = 69, /*!< 69 EFM32 DCDC Interrupt */
  PCNT0_IRQn             = 70, /*!< 70 EFM32 PCNT0 Interrupt */
  SW0_IRQn               = 71, /*!< 71 EFM32 SW0 Interrupt */
  SW1_IRQn               = 72, /*!< 72 EFM32 SW1 Interrupt */
  SW2_IRQn               = 73, /*!< 73 EFM32 SW2 Interrupt */
  SW3_IRQn               = 74, /*!< 74 EFM32 SW3 Interrupt */
  KERNEL0_IRQn           = 75, /*!< 75 EFM32 KERNEL0 Interrupt */
  KERNEL1_IRQn           = 76, /*!< 76 EFM32 KERNEL1 Interrupt */
  M33CTI0_IRQn           = 77, /*!< 77 EFM32 M33CTI0 Interrupt */
  M33CTI1_IRQn           = 78, /*!< 78 EFM32 M33CTI1 Interrupt */
  FPUEXH_IRQn            = 79, /*!< 79 EFM32 FPUEXH Interrupt */
  SETAMPERHOST_IRQn      = 80, /*!< 80 EFM32 SETAMPERHOST Interrupt */
  SEMBRX_IRQn            = 81, /*!< 81 EFM32 SEMBRX Interrupt */
  SEMBTX_IRQn            = 82, /*!< 82 EFM32 SEMBTX Interrupt */
  SYSRTC_APP_IRQn        = 83, /*!< 83 EFM32 SYSRTC_APP Interrupt */
  SYSRTC_SEQ_IRQn        = 84, /*!< 84 EFM32 SYSRTC_SEQ Interrupt */
  KEYSCAN_IRQn           = 85, /*!< 85 EFM32 KEYSCAN Interrupt */
  VDAC0_IRQn             = 88, /*!< 88 EFM32 VDAC0 Interrupt */
  VDAC1_IRQn             = 89, /*!< 89 EFM32 VDAC1 Interrupt */
  AHB2AHB0_IRQn          = 90, /*!< 90 EFM32 AHB2AHB0 Interrupt */
  AHB2AHB1_IRQn          = 91, /*!< 91 EFM32 AHB2AHB1 Interrupt */
  LCD_IRQn               = 92, /*!< 92 EFM32 LCD Interrupt */
} IRQn_Type;

/**************************************************************************//**
 * @defgroup EFM32PG26B101F512IM68_Core EFM32PG26B101F512IM68 Core
 * @{
 * @brief Processor and Core Peripheral Section
 *****************************************************************************/

#define __CORTEXM                 1U      /**< Core architecture */
#define __CM33_REV                0x0004U /**< Cortex-M33 Core revision */
#define __DSP_PRESENT             1U      /**< Presence of DSP  */
#define __FPU_PRESENT             1U      /**< Presence of FPU  */
#define __MPU_PRESENT             1U      /**< Presence of MPU  */
#define __SAUREGION_PRESENT       1U      /**< Presence of FPU  */
#define __TZ_PRESENT              1U      /**< Presence of TrustZone */
#define __VTOR_PRESENT            1U      /**< Presence of VTOR register in SCB  */
#define __NVIC_PRIO_BITS          4U      /**< NVIC interrupt priority bits */
#define __Vendor_SysTickConfig    0U      /**< Is 1 if different SysTick counter is used */

/** @} End of group EFM32PG26B101F512IM68_Core */

/**************************************************************************//**
* @defgroup EFM32PG26B101F512IM68_Part EFM32PG26B101F512IM68 Part
* @{
******************************************************************************/

